[NoCoverage] BlockStatement
src/arrays/arraylable.ts:1:55
-export function arraylable<T>(value: T[] | null): T[] {
-	return Array.isArray(value) ? value : [];
-}
+export function arraylable<T>(value: T[] | null): T[] {}
 
