[NoCoverage] BlockStatement
src/arrays/map.ts:1:70
-export const map = <T, U>(array: T[], fn: (element: T) => U): U[] => {
-	return array.map(fn);
-};
+export const map = <T, U>(array: T[], fn: (element: T) => U): U[] => {};
 
