[Killed] BlockStatement
src/check/isEmpty.ts:1:50
-export function isEmpty(value: unknown): boolean {
-	const isObject = value instanceof Object;
-	if (!isObject) return true;
-	return Object.entries(value).length === 0;
-}
+export function isEmpty(value: unknown): boolean {}
 
killedBy: isEmpty should return true if the value is an empty object
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isEmpty.ts:3:6
 export function isEmpty(value: unknown): boolean {
 	const isObject = value instanceof Object;
-	if (!isObject) return true;
+	if (true) return true;
 	return Object.entries(value).length === 0;
 }
killedBy: isEmpty should return false if the value is not an empty object
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/check/isEmpty.ts:3:6
 export function isEmpty(value: unknown): boolean {
 	const isObject = value instanceof Object;
-	if (!isObject) return true;
+	if (false) return true;
 	return Object.entries(value).length === 0;
 }
killedBy: isEmpty should return true if the value is null
statusReason: Cannot convert undefined or null to object

[Killed] EqualityOperator
src/check/isEmpty.ts:4:9
 export function isEmpty(value: unknown): boolean {
 	const isObject = value instanceof Object;
 	if (!isObject) return true;
-	return Object.entries(value).length === 0;
+	return Object.entries(value).length !== 0;
 }
 
killedBy: isEmpty should return true if the value is an empty object
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isEmpty.ts:4:9
 export function isEmpty(value: unknown): boolean {
 	const isObject = value instanceof Object;
 	if (!isObject) return true;
-	return Object.entries(value).length === 0;
+	return true;
 }
 
killedBy: isEmpty should return false if the value is not an empty object
statusReason: expected true to be false // Object.is equality
