[Killed] BlockStatement
src/check/isNullOrUndefined.ts:1:78
-export function isNullOrUndefined(value: unknown): value is null | undefined {
-	return value === null || value === undefined;
-}
+export function isNullOrUndefined(value: unknown): value is null | undefined {}
 
killedBy: isNullOrUndefined should return true if the value is null
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/check/isNullOrUndefined.ts:2:27
 export function isNullOrUndefined(value: unknown): value is null | undefined {
-	return value === null || value === undefined;
+	return value === null || value !== undefined;
 }
 
killedBy: isNullOrUndefined should return true if the value is undefined
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isNullOrUndefined.ts:2:27
 export function isNullOrUndefined(value: unknown): value is null | undefined {
-	return value === null || value === undefined;
+	return value === null || false;
 }
 
killedBy: isNullOrUndefined should return true if the value is undefined
statusReason: expected false to be true // Object.is equality
