[Killed] BlockStatement
src/check/isObject.ts:1:59
-export function isObject(value: unknown): value is object {
-	return (
-		typeof value === "object" &&
-		value !== null &&
-		!Array.isArray(value) &&
-		!(value instanceof Date) &&
-		!(value instanceof RegExp)
-	);
-}
+export function isObject(value: unknown): value is object {}
 
killedBy: isObject should return true if the value is an object
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/check/isObject.ts:3:3
 export function isObject(value: unknown): value is object {
 	return (
-		typeof value === "object" &&
-		value !== null &&
-		!Array.isArray(value) &&
-		!(value instanceof Date) &&
-		!(value instanceof RegExp)
+		typeof value === "object" && value !== null && !Array.isArray(value) && !(value instanceof Date) || !(value instanceof RegExp)
 	);
 }
killedBy: isObject should return false if the value is not an object
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/check/isObject.ts:3:3
 export function isObject(value: unknown): value is object {
 	return (
-		typeof value === "object" &&
-		value !== null &&
-		!Array.isArray(value) &&
-		!(value instanceof Date) &&
-		!(value instanceof RegExp)
+		true
 	);
 }
killedBy: isObject should return false if the value is not an object
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/check/isObject.ts:6:3
 		typeof value === "object" &&
 		value !== null &&
 		!Array.isArray(value) &&
-		!(value instanceof Date) &&
+		value instanceof Date &&
 		!(value instanceof RegExp)
 	);
killedBy: isObject should return true if the value is an object
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/check/isObject.ts:7:3
 		value !== null &&
 		!Array.isArray(value) &&
 		!(value instanceof Date) &&
-		!(value instanceof RegExp)
+		value instanceof RegExp
 	);
 }
killedBy: isObject should return true if the value is an object
statusReason: expected false to be true // Object.is equality
