[Killed] BlockStatement
src/check/isString.ts:1:59
-export function isString(value: unknown): value is string {
-	return typeof value === "string";
-}
+export function isString(value: unknown): value is string {}
 
killedBy: capitalize should capitalize the first letter of each word in the string
statusReason: expected 'hello world' to be 'Hello World' // Object.is equality

[Killed] ConditionalExpression
src/check/isString.ts:2:9
 export function isString(value: unknown): value is string {
-	return typeof value === "string";
+	return true;
 }
 
killedBy: capitalize should return the original string if it is not a string
statusReason: string.split is not a function

[Killed] ConditionalExpression
src/check/isString.ts:2:9
 export function isString(value: unknown): value is string {
-	return typeof value === "string";
+	return false;
 }
 
killedBy: capitalize should capitalize the first letter of each word in the string
statusReason: expected 'hello world' to be 'Hello World' // Object.is equality
