[Killed] BlockStatement
src/strings/capitalize.ts:3:55
 import { isString } from "@/check";
 
-export const capitalize = (string: string): string => {
-	if (!isString(string)) {
-		return string;
-	}
-	const splitString = string.split(" ");
-	return splitString
-		.map((word) => word.charAt(0).toUpperCase() + word.slice(1))
-		.join(" ");
-};
+export const capitalize = (string: string): string => {};
 
killedBy: capitalize should capitalize the first letter of each word in the string
statusReason: expected undefined to be 'Hello World' // Object.is equality

[Killed] BooleanLiteral
src/strings/capitalize.ts:4:6
 import { isString } from "@/check";
 
 export const capitalize = (string: string): string => {
-	if (!isString(string)) {
+	if (isString(string)) {
 		return string;
 	}
killedBy: capitalize should capitalize the first letter of each word in the string
statusReason: expected 'hello world' to be 'Hello World' // Object.is equality

[Killed] ConditionalExpression
src/strings/capitalize.ts:4:6
 import { isString } from "@/check";
 
 export const capitalize = (string: string): string => {
-	if (!isString(string)) {
+	if (true) {
 		return string;
 	}
killedBy: capitalize should capitalize the first letter of each word in the string
statusReason: expected 'hello world' to be 'Hello World' // Object.is equality

[Killed] ArrowFunction
src/strings/capitalize.ts:9:8
 	}
 	const splitString = string.split(" ");
 	return splitString
-		.map((word) => word.charAt(0).toUpperCase() + word.slice(1))
+		.map(() => undefined)
 		.join(" ");
 };
killedBy: capitalize should capitalize the first letter of each word in the string
statusReason: expected ' ' to be 'Hello World' // Object.is equality

[Killed] MethodExpression
src/strings/capitalize.ts:9:49
 	}
 	const splitString = string.split(" ");
 	return splitString
-		.map((word) => word.charAt(0).toUpperCase() + word.slice(1))
+		.map((word) => word.charAt(0).toUpperCase() + word)
 		.join(" ");
 };
killedBy: capitalize should capitalize the first letter of each word in the string
statusReason: expected 'Hhello Wworld' to be 'Hello World' // Object.is equality

[Killed] StringLiteral
src/strings/capitalize.ts:10:9
 	const splitString = string.split(" ");
 	return splitString
 		.map((word) => word.charAt(0).toUpperCase() + word.slice(1))
-		.join(" ");
+		.join("");
 };
 
killedBy: capitalize should capitalize the first letter of each word in the string
statusReason: expected 'HelloWorld' to be 'Hello World' // Object.is equality
