[Killed] BlockStatement
src/strings/includes.ts:3:73
 import { isString } from "@/check";
 
-export const includes = (string: string, substring: string): boolean => {
-	return isString(string) && isString(substring)
-		? string.includes(substring)
-		: false;
-};
+export const includes = (string: string, substring: string): boolean => {};
 
killedBy: includes should return true if the string includes the substring
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/strings/includes.ts:4:9
 import { isString } from "@/check";
 
 export const includes = (string: string, substring: string): boolean => {
-	return isString(string) && isString(substring)
+	return isString(string) || isString(substring)
 		? string.includes(substring)
 		: false;
killedBy: includes should return false if the string is null
statusReason: Cannot read properties of null (reading 'includes')

[Killed] ConditionalExpression
src/strings/includes.ts:4:9
 import { isString } from "@/check";
 
 export const includes = (string: string, substring: string): boolean => {
-	return isString(string) && isString(substring)
+	return true
 		? string.includes(substring)
 		: false;
killedBy: includes should return false if the string is null
statusReason: Cannot read properties of null (reading 'includes')

[Killed] BooleanLiteral
src/strings/includes.ts:6:5
 export const includes = (string: string, substring: string): boolean => {
 	return isString(string) && isString(substring)
 		? string.includes(substring)
-		: false;
+		: true;
 };
 
killedBy: includes should return false if the string is null
statusReason: expected true to be false // Object.is equality
