[Killed] BlockStatement
src/timing/debounce.ts:6:37
 export function debounce<T extends AnyFunction>(
 	fn: T,
 	delay = 200,
-): (...args: Parameters<T>) => void {
-	let timeoutId: NodeJS.Timeout | undefined;
-	return function debouncedFn(...args: Parameters<T>) {
-		if (timeoutId !== undefined) {
-			clearTimeout(timeoutId);
-		}
-		timeoutId = setTimeout(() => {
-			timeoutId = undefined;
-			return fn(...args);
-		}, delay);
-	};
-}
+): (...args: Parameters<T>) => void {}
 
killedBy: debounce should no execute the function
statusReason: debouncedFn is not a function

[Killed] BlockStatement
src/timing/debounce.ts:8:54
 	delay = 200,
 ): (...args: Parameters<T>) => void {
 	let timeoutId: NodeJS.Timeout | undefined;
-	return function debouncedFn(...args: Parameters<T>) {
-		if (timeoutId !== undefined) {
-			clearTimeout(timeoutId);
-		}
-		timeoutId = setTimeout(() => {
-			timeoutId = undefined;
-			return fn(...args);
-		}, delay);
-	};
+	return function debouncedFn(...args: Parameters<T>) {};
 }
 
killedBy: debounce should debounce the function and execute it after the delay
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/timing/debounce.ts:9:7
 ): (...args: Parameters<T>) => void {
 	let timeoutId: NodeJS.Timeout | undefined;
 	return function debouncedFn(...args: Parameters<T>) {
-		if (timeoutId !== undefined) {
+		if (false) {
 			clearTimeout(timeoutId);
 		}
killedBy: debounce should debounce the function and execute it after the delay
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] EqualityOperator
src/timing/debounce.ts:9:7
 ): (...args: Parameters<T>) => void {
 	let timeoutId: NodeJS.Timeout | undefined;
 	return function debouncedFn(...args: Parameters<T>) {
-		if (timeoutId !== undefined) {
+		if (timeoutId === undefined) {
 			clearTimeout(timeoutId);
 		}
killedBy: debounce should debounce the function and execute it after the delay
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/timing/debounce.ts:12:32
 		if (timeoutId !== undefined) {
 			clearTimeout(timeoutId);
 		}
-		timeoutId = setTimeout(() => {
-			timeoutId = undefined;
-			return fn(...args);
-		}, delay);
+		timeoutId = setTimeout(() => {}, delay);
 	};
 }
killedBy: debounce should debounce the function and execute it after the delay
statusReason: expected "spy" to be called 1 times, but got 0 times
