[Killed] BlockStatement
src/timing/throttle.ts:5:37
 export function throttle<T extends AnyFunction>(
 	fn: T,
 	delay = 500,
-): (...args: Parameters<T>) => void {
-	let timeOutId: ReturnType<typeof setTimeout> | undefined;
-	return function throttledFn(...args: Parameters<T>) {
-		if (timeOutId !== undefined) {
-			return;
-		}
-		timeOutId = setTimeout(() => {
-			timeOutId = undefined;
-		}, delay);
-		return fn(...args);
-	};
-}
+): (...args: Parameters<T>) => void {}
 
killedBy: throttle should throttle the function
statusReason: throttledFn is not a function

[Killed] BlockStatement
src/timing/throttle.ts:7:54
 	delay = 500,
 ): (...args: Parameters<T>) => void {
 	let timeOutId: ReturnType<typeof setTimeout> | undefined;
-	return function throttledFn(...args: Parameters<T>) {
-		if (timeOutId !== undefined) {
-			return;
-		}
-		timeOutId = setTimeout(() => {
-			timeOutId = undefined;
-		}, delay);
-		return fn(...args);
-	};
+	return function throttledFn(...args: Parameters<T>) {};
 }
 
killedBy: throttle should throttle the function
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/timing/throttle.ts:8:7
 ): (...args: Parameters<T>) => void {
 	let timeOutId: ReturnType<typeof setTimeout> | undefined;
 	return function throttledFn(...args: Parameters<T>) {
-		if (timeOutId !== undefined) {
+		if (true) {
 			return;
 		}
killedBy: throttle should throttle the function
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/timing/throttle.ts:8:32
 ): (...args: Parameters<T>) => void {
 	let timeOutId: ReturnType<typeof setTimeout> | undefined;
 	return function throttledFn(...args: Parameters<T>) {
-		if (timeOutId !== undefined) {
-			return;
-		}
+		if (timeOutId !== undefined) {}
 		timeOutId = setTimeout(() => {
 			timeOutId = undefined;
killedBy: throttle should throttle the function
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/timing/throttle.ts:11:32
 		if (timeOutId !== undefined) {
 			return;
 		}
-		timeOutId = setTimeout(() => {
-			timeOutId = undefined;
-		}, delay);
+		timeOutId = setTimeout(() => {}, delay);
 		return fn(...args);
 	};
killedBy: throttle should throttle the function
statusReason: expected "spy" to be called 2 times, but got 1 times
